#ifndef TOKEN_H
#define TOKEN_H

typedef struct TOKEN 
{
    enum
    {
        მიმატება,
        გამოკლება,
        გამრავლება,
        გაყოფა,
        
        //ხარისხი,
        //div,
        //mod,

        მძიმე,
        წერტილი,
        ორწერტილი,
        
        //მინიჭება,
        ტოლობა,
        მეტობა,
        ნაკლებობა,
        //მეტობა_ტოლობა,
        //ნაკლებობა_ტოლობა,
        //არ_უდრის,

        ფრჩხილი_1,
        ფრჩხილი_2,

        იდენტიფიკატორი,
        სტრინგი,
        //რიცხვი,

        //დასაწყისი,
        //დასასრული
    } type;
    char* value;
}token_T;

token_T* init_token(int type, char* value);

#endif